# Elección de Datasets potenciales

Identificar 3 datasets que cumplan con las siguientes condiciones: 
1. al menos 2000 filas y 
2. al menos 15 columnas. 

Pueden buscar en las siguientes fuentes: GitLab, Github, Kaggle, Google Dataset Search (Si desean trabajar con un archivo propio se puede también).
Algunas API recomendadas para obtener información: Marvel,PokeApi,CovidTracking,Nomics (Criptomonedas),Wheater API

Cargar los archivos correspondientes por medio de la librería pandas.<br />
Describir las variables potencialmente interesantes en cada archivo teniendo en cuenta el contexto comercial y analítico involucrado

In [1]:
import pandas as pd
import numpy as np

In [2]:
url1 = "https://raw.githubusercontent.com/dphi-official/Datasets/master/Census_Income/Training_set_census.csv"
url2 = "https://raw.githubusercontent.com/dphi-official/Datasets/master/IT_Salary_Survey_EU_18-20/Survey_2020.csv"
url3 = "https://raw.githubusercontent.com/dphi-official/Datasets/master/Chronic%20Kidney%20Disease%20(CKD)%20Dataset/ChronicKidneyDisease.csv"

### URLs selection reasons 
The most important reasons to be select those urls are to be achive the requirements. However, I have some another reasons to be selected it.<br />
The first *url1* is just to fullfil what's demand. The second *url2* it is chosen because I feel that it could be interesting study IT salaries at the pandemic era, provocated by COVID-19 virus. The last **url3** it is specialy selected because I would like to study a little bit about **CKD** (Chronic Kidney Disease) for my mother situation.

In [3]:
import time # to compute execution time

In [4]:
start = time.time()
census_income = pd.read_csv(url1)
print("Load time URL1",time.time() - start)

Load time URL1 6.9256911277771

In [5]:
start = time.time()
it_salary_2020 = pd.read_csv(url2)
print("Load time URL2",time.time() - start)

Load time URL2 0.706444501876831

In [6]:
start = time.time()
csk = pd.read_csv(url3)
print("Load time URL3",time.time() - start)

Load time URL3 0.3965110778808594

### Print infos
Printing data set informations.

In [7]:
census_income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 41 columns):
 #   Column                            Non-Null Count   Dtype
---  ------                            --------------   -----
 0   age                               200000 non-null  int64
 1   class_of_worker                   200000 non-null  object
 2   industry_code                     200000 non-null  int64
 3   occupation_code                   200000 non-null  int64
 4   education                         200000 non-null  object
 5   wage_per_hour                     200000 non-null  int64
 6   enrolled_in_edu_inst_lastwk       200000 non-null  object
 7   marital_status                    200000 non-null  object
 8   major_industry_code               200000 non-null  object
 9   major_occupation_code             200000 non-null  object
 10  race                              200000 non-null  object
 11  hispanic_origin                   199408 non-null  object
 12  sex                               200000 non-null  object
 13  member_of_labor_union             200000 non-null  object
 14  reason_for_unemployment           200000 non-null  object
 15  full_parttime_employment_stat     200000 non-null  object
 16  capital_gains                     200000 non-null  int64
 17  capital_losses                    200000 non-null  int64
 18  dividend_from_Stocks              200000 non-null  int64
 19  tax_filer_status                  200000 non-null  object
 20  region_of_previous_residence      200000 non-null  object
 21  state_of_previous_residence       199523 non-null  object
 22  d_household_family_stat           200000 non-null  object
 23  d_household_summary               200000 non-null  object
 24  migration_msa                     133327 non-null  object
 25  migration_reg                     133327 non-null  object
 26  migration_within_reg              133327 non-null  object
 27  live_1_year_ago                   200000 non-null  object
 28  migration_sunbelt                 133327 non-null  object
 29  num_person_Worked_employer        200000 non-null  int64
 30  family_members_under_18           200000 non-null  object
 31  country_father                    195478 non-null  object
 32  country_mother                    195864 non-null  object
 33  country_self                      197688 non-null  object
 34  citizenship                       200000 non-null  object
 35  business_or_self_employed         200000 non-null  int64
 36  fill_questionnaire_veteran_admin  200000 non-null  object
 37  veterans_benefits                 200000 non-null  int64
 38  weeks_worked_in_year              200000 non-null  int64
 39  year                              200000 non-null  int64
 40  income_level                      200000 non-null  int64
dtypes: int64(13), object(28)
memory usage: 62.6+ MB

In [8]:
it_salary_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1253 entries, 0 to 1252
Data columns (total 23 columns):
 #   Column                                                                                                                   Non-Null Count  Dtype
---  ------                                                                                                                   --------------  -----
 0   Timestamp                                                                                                                1253 non-null   object
 1   Age                                                                                                                      1226 non-null   float64
 2   Gender                                                                                                                   1243 non-null   object
 3   City                                                                                                                     1253 non-null   object
 4   Position                                                                                                                 1247 non-null   object
 5   Total years of experience                                                                                                1237 non-null   object
 6   Years of experience in Germany                                                                                           1221 non-null   object
 7   Seniority level                                                                                                          1241 non-null   object
 8   Your main technology / programming language                                                                              1126 non-null   object
 9   Other technologies/programming languages you use often                                                                   1096 non-null   object
 10  Yearly brutto salary (without bonus and stocks) in EUR                                                                   1253 non-null   float64
 11  Yearly bonus + stocks in EUR                                                                                             829 non-null    object
 12  Annual brutto salary (without bonus and stocks) one year ago. Only answer if staying in the same country                 885 non-null    float64
 13  Annual bonus+stocks one year ago. Only answer if staying in same country                                                 614 non-null    object
 14  Number of vacation days                                                                                                  1185 non-null   object
 15  Employment status                                                                                                        1236 non-null   object
 16  Сontract duration                                                                                                        1224 non-null   object
 17  Main language at work                                                                                                    1237 non-null   object
 18  Company size                                                                                                             1235 non-null   object
 19  Company type                                                                                                             1228 non-null   object
 20  Have you lost your job due to the coronavirus outbreak?                                                                  1233 non-null   object
 21  Have you been forced to have a shorter working week (Kurzarbeit)? If yes, how many hours per week                        373 non-null    float64
 22  Have you received additional monetary support from your employer due to Work From Home? If yes, how much in 2020 in EUR  462 non-null    object
dtypes: float64(4), object(19)
memory usage: 225.3+ KB

In [9]:
csk.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 26 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              400 non-null    int64
 1   age             391 non-null    float64
 2   bp              388 non-null    float64
 3   sg              353 non-null    float64
 4   al              354 non-null    float64
 5   su              351 non-null    float64
 6   rbc             248 non-null    object
 7   pc              335 non-null    object
 8   pcc             396 non-null    object
 9   ba              396 non-null    object
 10  bgr             356 non-null    float64
 11  bu              381 non-null    float64
 12  sc              383 non-null    float64
 13  sod             313 non-null    float64
 14  pot             312 non-null    float64
 15  hemo            348 non-null    float64
 16  pcv             330 non-null    object
 17  wc              295 non-null    object
 18  rc              270 non-null    object
 19  htn             398 non-null    object
 20  dm              398 non-null    object
 21  cad             398 non-null    object
 22  appet           399 non-null    object
 23  pe              399 non-null    object
 24  ane             399 non-null    object
 25  classification  400 non-null    object
dtypes: float64(11), int64(1), object(14)
memory usage: 81.4+ KB

### Describe Datasets
Print dataset descriptions

In [10]:
census_income.describe()

,age,industry_code,occupation_code,wage_per_hour,capital_gains,capital_losses,dividend_from_Stocks,num_person_Worked_employer,business_or_self_employed,veterans_benefits,weeks_worked_in_year,year,income_level
count,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000,200000.000000
mean,34.662495,15.564830,11.326325,54.835700,493.561580,38.921275,212.977630,1.983780,0.177995,1.522860,23.541820,94.499800,0.074360
std,22.225765,18.104961,14.424809,272.034681,5109.900136,277.867944,2062.591247,2.372892,0.557014,0.846346,24.447497,0.500001,0.262357
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,94.000000,0.000000
25%,16.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,2.000000,0.000000,94.000000,0.000000
50%,33.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,2.000000,10.000000,94.000000,0.000000
75%,50.000000,33.000000,26.000000,0.000000,0.000000,0.000000,0.000000,4.000000,0.000000,2.000000,52.000000,95.000000,0.000000
max,90.000000,51.000000,46.000000,9999.000000,99999.000000,4608.000000,99999.000000,6.000000,2.000000,2.000000,52.000000,95.000000,1.000000

In [11]:
it_salary_2020.describe()

,Age,Yearly brutto salary (without bonus and stocks) in EUR,Annual brutto salary (without bonus and stocks) one year ago. Only answer if staying in the same country,"Have you been forced to have a shorter working week (Kurzarbeit)? If yes, how many hours per week"
count,1226.000000,1.253000e+03,8.850000e+02,373.000000
mean,32.509788,8.027904e+07,6.322459e+05,12.967828
std,5.663804,2.825061e+09,1.680508e+07,15.275174
min,20.000000,1.000100e+04,1.100000e+04,0.000000
25%,29.000000,5.880000e+04,5.500000e+04,0.000000
50%,32.000000,7.000000e+04,6.500000e+04,0.000000
75%,35.000000,8.000000e+04,7.500000e+04,30.000000
max,69.000000,1.000000e+11,5.000000e+08,40.000000

In [12]:
csk.describe()

,id,age,bp,sg,al,su,bgr,bu,sc,sod,pot,hemo
count,400.000000,391.000000,388.000000,353.000000,354.000000,351.000000,356.000000,381.000000,383.000000,313.000000,312.000000,348.000000
mean,199.500000,51.483376,76.469072,1.017408,1.016949,0.450142,148.036517,57.425722,3.072454,137.528754,4.627244,12.526437
std,115.614301,17.169714,13.683637,0.005717,1.352679,1.099191,79.281714,50.503006,5.741126,10.408752,3.193904,2.912587
min,0.000000,2.000000,50.000000,1.005000,0.000000,0.000000,22.000000,1.500000,0.400000,4.500000,2.500000,3.100000
25%,99.750000,42.000000,70.000000,1.010000,0.000000,0.000000,99.000000,27.000000,0.900000,135.000000,3.800000,10.300000
50%,199.500000,55.000000,80.000000,1.020000,0.000000,0.000000,121.000000,42.000000,1.300000,138.000000,4.400000,12.650000
75%,299.250000,64.500000,80.000000,1.020000,2.000000,0.000000,163.000000,66.000000,2.800000,142.000000,4.900000,15.000000
max,399.000000,90.000000,180.000000,1.025000,5.000000,5.000000,490.000000,391.000000,76.000000,163.000000,47.000000,17.800000

### Some research about *Census income*
Try to compare between adults people that contribute to the state between retired that capital gains are less than 21% of mean and young people (until 18 years old).

In [13]:
census_retired = census_income[census_income['age']>65]
census_young = census_income[census_income['age']<19]

census_adults = census_income[18<census_income['age']]
census_productive_ages = census_adults[census_adults['age']<66]
print(f"census_retired:\t\t{len(census_retired)}")
print(f"census_young:\t\t{len(census_young)}")
print(f"census_productive_ages:\t{len(census_productive_ages)}")
print(f"Check counting:{len(census_retired)+len(census_young)+len(census_productive_ages)}")

census_retired:		22633
census_young:		57658
census_productive_ages:	119709
Check counting:200000

In [14]:
retired_no_contributs = 0.21
census_retired_low_capital = census_retired[census_retired["capital_gains"]<(retired_no_contributs*census_income["capital_gains"].mean())]
print(f"Retired people that the capital gains are less than 21% of mean are: {len(census_retired_low_capital)}. They should't contributs.")

Retired people that the capital gains are less than 21% of mean are: 21130. They should't contributs.

In [15]:
contributors = len(census_productive_ages)+len(census_retired)-len(census_retired_low_capital)
print(f"There are {round(contributors*100/len(census_income),2)}% of contributors in populations")

There are 60.61% of contributors in populations

### Some research about *IT salary in the year 2020*
Try to figure out the worst payment IT jobs in the year 2020. Also, how much they pay it.<br />
I considered the worst payment IT jobs for those people that are 3 sigma below from mean salaries.

In [16]:
#year_salary_no_bonus = it_salary_2020['Yearly brutto salary (without bonus and stocks) in EUR'].replace(np.nan, 0)
#year_bonus           = it_salary_2020['Yearly bonus + stocks in EUR'].replace(np.nan, 0)
year_salary_index    = ['Yearly brutto salary (without bonus and stocks) in EUR', 'Yearly bonus + stocks in EUR']

In [17]:
year_salary_detail = it_salary_2020[year_salary_index]
print(year_salary_detail.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1253 entries, 0 to 1252
Data columns (total 2 columns):
 #   Column                                                  Non-Null Count  Dtype
---  ------                                                  --------------  -----
 0   Yearly brutto salary (without bonus and stocks) in EUR  1253 non-null   float64
 1   Yearly bonus + stocks in EUR                            829 non-null    object
dtypes: float64(1), object(1)
memory usage: 19.7+ KB
None

In [18]:
year_salary_detail[year_salary_index[1]] = pd.to_numeric(year_salary_detail[year_salary_index[1]],errors='coerce')
print(year_salary_detail.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1253 entries, 0 to 1252
Data columns (total 2 columns):
 #   Column                                                  Non-Null Count  Dtype
---  ------                                                  --------------  -----
 0   Yearly brutto salary (without bonus and stocks) in EUR  1253 non-null   float64
 1   Yearly bonus + stocks in EUR                            823 non-null    float64
dtypes: float64(2)
memory usage: 19.7 KB
None

C:\Users\leeca\AppData\Local\Temp\ipykernel_27632\1114512227.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  year_salary_detail[year_salary_index[1]] = pd.to_numeric(year_salary_detail[year_salary_index[1]],errors='coerce')

In [19]:
year_salary_detail = year_salary_detail.replace(np.nan, 0)
year_salary        = year_salary_detail.sum(axis=1)

In [20]:
year_salary.describe()

count    1.253000e+03
mean     8.428361e+07
std      2.829182e+09
min      1.000100e+04
25%      6.000000e+04
50%      7.400000e+04
75%      9.100000e+04
max      1.000000e+11
dtype: float64

In [21]:
year_salary_np = year_salary.to_numpy()

In [22]:
print(year_salary_np.mean())
print(year_salary_np.std())

84283611.13693535
2828053095.7816143

As we can see that standard deviation are larger than mean. It is mean that the salaries are scattered.<br />
Hence, I am going to select the 10% of the salary that it gived data frame quantile.

In [23]:
low_salary = year_salary.quantile(0.10)
job_position_worst_paid = it_salary_2020[year_salary<low_salary]['Position '].value_counts()
print(job_position_worst_paid)

Software Engineer                           25
Backend Developer                           17
Frontend Developer                          12
Data Scientist                              11
QA Engineer                                  8
ML Engineer                                  7
Designer (UI/UX)                             6
Mobile Developer                             3
Product Manager                              2
Project Manager                              2
DevOps                                       2
Beikoch                                      1
computer vision researcher                   1
QA Manager                                   1
XR Developer                                 1
BI Analyst                                   1
Robotics Engineer                            1
Data Engineer                                1
DatabEngineer                                1
Application Consultant                       1
Data Analyst                                 1
Tech recruiting                              1
Analyst                                      1
Test manager                                 1
working student (QA)                         1
Dana Analyst                                 1
Researcher                                   1
HiWi                                         1
Systemadministrator                          1
Graphic Designer                             1
Consultant Data Analytics                    1
C/C++/Java developer                         1
Firmware Engineer                            1
System Administrator                         1
Fullstack Developer                          1
Business Development Manager Operations      1
Name: Position , dtype: int64

# Another two data sets

Sólo faltaría buscar dos datasets que cumplan los requisitos mínimos, y explicar cuáles atributos son interesantes. No hace falta que hagas un análisis de datos profundo como el que hiciste, pero sí que expliques el contexto de los datasets y por qué seleccionaste tal o tal atributos de cada dataset.

In [92]:
url4 = "https://raw.githubusercontent.com/YBI-Foundation/Dataset/main/Airline%20Delay.csv"
url5 = "https://raw.githubusercontent.com/YBI-Foundation/Dataset/main/AdultIncome.csv"

In [93]:
airline_delay = pd.read_csv(url4)
adult_income = pd.read_csv(url5)

### Airline delay
I am going to print the airport where it had worst delay

In [94]:
airline_delay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3351 entries, 0 to 3350
Data columns (total 21 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   year                 3351 non-null   int64
 1   month                3351 non-null   int64
 2   carrier              3351 non-null   object
 3   carrier_name         3351 non-null   object
 4   airport              3351 non-null   object
 5   airport_name         3351 non-null   object
 6   arr_flights          3343 non-null   float64
 7   arr_del15            3343 non-null   float64
 8   carrier_ct           3343 non-null   float64
 9   weather_ct           3343 non-null   float64
 10  nas_ct               3343 non-null   float64
 11  security_ct          3343 non-null   float64
 12  late_aircraft_ct     3343 non-null   float64
 13  arr_cancelled        3343 non-null   float64
 14  arr_diverted         3343 non-null   float64
 15  arr_delay            3343 non-null   float64
 16  carrier_delay        3343 non-null   float64
 17  weather_delay        3343 non-null   float64
 18  nas_delay            3343 non-null   float64
 19  security_delay       3343 non-null   float64
 20  late_aircraft_delay  3343 non-null   float64
dtypes: float64(15), int64(2), object(4)
memory usage: 549.9+ KB

In [96]:
delay_max = airline_delay["late_aircraft_delay"].max()
flight_worst_delay = airline_delay[airline_delay["late_aircraft_delay"] == delay_max]

In [97]:
airport = flight_worst_delay.iloc[0]["airport_name"]
print(f"The worst delay flight was in \'{airport}\' airport.")

The worst delay flight was in 'Boston, MA: Logan International' airport.

### Adult income
I am going to print count of half time workers

In [104]:
adult_income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  country         32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [98]:
adult_income.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [102]:
work_half = sum(adult_income["hours-per-week"]<25)
print(f"There are {work_half} adult that work part time on {adult_income.shape[0]}")

There are 3269 adult that work part time on 32561